<big><b>Step 1:</b> Load the SQL extension</big>

In [1]:
%load_ext sql

<big><b>Step 2</b>: Connect sqlite to CourseDataWarehouse database</big>

In [2]:
%%sql

sqlite:///CourseDataWarehouseDemo.db
    
attach "CourseData.db" as db1

Done.

[]

<big><b>Step 3</b>: We begin by first creating the six dimension tables, as shown in our ERD. We intend to first create the dimension tables, then the fact table - as the fact table will have foreign key relationships to each dimension.</big>

<b>3-1</b>: Per our Star schema ERD, we create the dimension tables as follows: INSTRUCTOR_WH, LOCATION_WH, PROGRAM_WH, CATALOG_COURSE_WH, TIME_CODE_WH, and TERM_WH.

In [5]:
%%sql

DROP TABLE IF EXISTS CATALOG_COURSE_WH;
CREATE TABLE CATALOG_COURSE_WH (
    CAID INTEGER PRIMARY KEY,
    CatalogID TEXT NOT NULL,
    Title TEXT NOT NULL,
    Attributes TEXT,
    Description TEXT,
    Prereqs TEXT
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [6]:
%%sql

DROP TABLE IF EXISTS INSTRUCTOR_WH;
CREATE TABLE INSTRUCTOR_WH (
    IID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [7]:
%%sql

DROP TABLE IF EXISTS LOCATION_WH;
CREATE TABLE LOCATION_WH (
    LID INTEGER PRIMARY KEY,
    Location TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [8]:
%%sql

DROP TABLE IF EXISTS PROGRAM_WH;
CREATE TABLE PROGRAM_WH (
    PID INTEGER PRIMARY KEY,
    ProgramCode TEXT NOT NULL,
    ProgramName TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [9]:
%%sql

DROP TABLE IF EXISTS CATALOG_COURSE_WH;
CREATE TABLE CATALOG_COURSE_WH (
    CAID INTEGER PRIMARY KEY,
    CatalogID TEXT NOT NULL,
    Title TEXT NOT NULL,
    Attributes TEXT,
    Description TEXT,
    Prereqs TEXT
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [10]:
%%sql

DROP TABLE IF EXISTS TIME_CODE_WH;
CREATE TABLE TIME_CODE_WH (
    TCID INT PRIMARY KEY,
    Meetings TEXT NULL
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

In [11]:
%%sql

DROP TABLE IF EXISTS TERM_WH;
CREATE TABLE TERM_WH (
    TermID INTEGER PRIMARY KEY,
    Term TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

<b>3-2</b>: Per our Star schema ERD, since we have created all the dimension tables. We move on to create the fact table REG_COURSE_WH and proceed with linking each of the applicable foreign keys.

In [12]:
%%sql

DROP TABLE IF EXISTS REG_COURSE_WH;
CREATE TABLE REG_COURSE_WH (
    COID INTEGER PRIMARY KEY,
    TCID INTEGER,
    LID INTEGER,
    CAID INTEGER,
    IID INTEGER,
    TermID INTEGER,
    PID INTEGER, 
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    Credits INTEGER,
    Day TEXT,
    Start INTEGER,
    End INTEGER, 
    FOREIGN KEY (TCID) REFERENCES TIME_CODE_WH(TCID),
    FOREIGN KEY (LID) REFERENCES LOCATION_WH(LID),
    FOREIGN KEY (CAID) REFERENCES CATALOG_COURSE_WH(TID),
    FOREIGN KEY (IID) REFERENCES INSTRUCTOR_WH(IID),
    FOREIGN KEY (TermID) REFERENCES TERM_WH(TermID),
    FOREIGN KEY (PID) REFERENCES PROGRAM_WH(PID)
    )

 * sqlite:///CourseDataWarehouseDemo.db
Done.
Done.

[]

<big><b>Step 4</b>: Now that tables have been created, we begin importing the data from our normalized database. We will follow the table creation order and import the dimension table data first, then the fact table data.</big>

<b>4-1</b>: We populate the dimension tables as follows: INSTRUCTOR_WH, LOCATION_WH, PROGRAM_WH, CATALOG_COURSE_WH, TIME_CODE_WH, and TERM_WH.

In [13]:
%%sql

DELETE FROM INSTRUCTOR_WH;
INSERT INTO INSTRUCTOR_WH (Name)
    SELECT DISTINCT db1.INSTRUCTOR.Name
    FROM db1.INSTRUCTOR;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
1104 rows affected.

[]

In [14]:
%%sql

DELETE FROM LOCATION_WH;
INSERT INTO LOCATION_WH (LID, Location)
    SELECT DISTINCT db1.LOCATION.LID, db1.LOCATION.Location
    FROM db1.LOCATION;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
207 rows affected.

[]

In [17]:
%%sql

DELETE FROM PROGRAM_WH;
INSERT INTO PROGRAM_WH (ProgramCode, ProgramName)
    SELECT DISTINCT ProgramCode, ProgramName
    FROM db1.PROGRAM;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
83 rows affected.

[]

In [16]:
%%sql

DELETE FROM CATALOG_COURSE_WH;
INSERT INTO CATALOG_COURSE_WH (CatalogID, Title, Attributes, Description, Prereqs)
    SELECT DISTINCT CatalogID, Title, Attributes, Description, Prereqs
    FROM db1.CATALOG_COURSE;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
2220 rows affected.

[]

In [15]:
%%sql

DELETE FROM TIME_CODE_WH;
INSERT INTO TIME_CODE_WH (Meetings)
    SELECT DISTINCT OFFERINGS_COURSE.Meetings
    FROM db1.OFFERINGS_COURSE;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
12039 rows affected.

[]

In [18]:
%%sql

DELETE FROM TERM_WH;
INSERT INTO TERM_WH (Term)
    SELECT DISTINCT Term
    FROM db1.OFFERINGS_COURSE;

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
19 rows affected.

[]

<b>4-2</b>: Due to the complicated nature of the fact table, we first test the select query to make sure all of the data is pulling properly first. After confirming the select query is pulling the data correctly, we populate the fact table.

In [19]:
%%sql

SELECT DISTINCT db1.MEETINGS_COURSE.CMID, db1.LOCATION.LID, db1.CATALOG_COURSE.CAID,
                     INSTRUCTOR_WH.IID, TERM_WH.TermID, db1.PROGRAM.PID, db1.OFFERINGS_COURSE.Cap, 
                     db1.OFFERINGS_COURSE.Act, db1.OFFERINGS_COURSE.Rem, db1.CATALOG_COURSE.Credits, 
                     db1.MEETINGS_COURSE.Day, db1.MEETINGS_COURSE.Start, db1.MEETINGS_COURSE.End
FROM db1.OFFERINGS_COURSE
        LEFT JOIN db1.CATALOG_COURSE ON (OFFERINGS_COURSE.CatalogID = CATALOG_COURSE.CatalogID)
        LEFT JOIN db1.PROGRAM ON (CATALOG_COURSE.ProgramName = PROGRAM.ProgramName)
        LEFT JOIN INSTRUCTOR ON (OFFERINGS_COURSE.Name = INSTRUCTOR.Name)
        LEFT JOIN db1.MEETINGS_COURSE ON (OFFERINGS_COURSE.CRN = MEETINGS_COURSE.CRN)
        LEFT JOIN db1.LOCATION ON (MEETINGS_COURSE.Location = LOCATION.Location)
        LEFT JOIN TERM_WH ON (OFFERINGS_COURSE.Term = TERM_WH.Term)
        LEFT JOIN INSTRUCTOR_WH ON (INSTRUCTOR.IID = INSTRUCTOR_WH.IID)
WHERE LOCATION.LID = 10
    
LIMIT 20;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(795, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-09-10T10:50:00', '2014-09-10T13:50:00'),
 (796, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-09-17T10:50:00', '2014-09-17T13:50:00'),
 (797, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-09-24T10:50:00', '2014-09-24T13:50:00'),
 (798, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-10-01T10:50:00', '2014-10-01T13:50:00'),
 (799, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-10-08T10:50:00', '2014-10-08T13:50:00'),
 (800, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-10-15T10:50:00', '2014-10-15T13:50:00'),
 (801, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-10-22T10:50:00', '2014-10-22T13:50:00'),
 (802, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-10-29T10:50:00', '2014-10-29T13:50:00'),
 (803, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-11-05T10:50:00', '2014-11-05T13:50:00'),
 (804, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-11-12T10:50:00', '2014-11-12T13:50:00'),
 (805, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-11-19T10:50:00', '2014-11-19T13:50:00'),
 (806, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-11-26T10:50:00', '2014-11-26T13:50:00'),
 (807, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-12-03T10:50:00', '2014-12-03T13:50:00'),
 (808, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-12-10T10:50:00', '2014-12-10T13:50:00'),
 (809, 10, 364, 16, 1, 12, 13, 15, -2, '3 Credits', 'W', '2014-12-17T10:50:00', '2014-12-17T13:50:00'),
 (810, 10, 406, 16, 1, 12, 12, 12, 0, '3 Credits', 'T', '2014-09-02T10:50:00', '2014-09-02T13:50:00'),
 (811, 10, 406, 16, 1, 12, 12, 12, 0, '3 Credits', 'T', '2014-09-09T10:50:00', '2014-09-09T13:50:00'),
 (812, 10, 406, 16, 1, 12, 12, 12, 0, '3 Credits', 'T', '2014-09-16T10:50:00', '2014-09-16T13:50:00'),
 (813, 10, 406, 16, 1, 12, 12, 12, 0, '3 Credits', 'T', '2014-09-23T10:50:00', '2014-09-23T13:50:00'),
 (814, 10, 406, 16, 1, 12, 12, 12, 0, '3 Credits', 'T', '2014-09-30T10:50:00', '2014-09-30T13:50:00')]

In [20]:
%%sql

DELETE FROM REG_COURSE_WH;
INSERT INTO REG_COURSE_WH (TCID, LID, CAID, IID, TermID, PID, Cap, Act, Rem, Credits, Day, Start, End)
    SELECT DISTINCT db1.MEETINGS_COURSE.CMID, db1.LOCATION.LID, db1.CATALOG_COURSE.CAID,
                     INSTRUCTOR_WH.IID, TERM_WH.TermID, db1.PROGRAM.PID, db1.OFFERINGS_COURSE.Cap, 
                     db1.OFFERINGS_COURSE.Act, db1.OFFERINGS_COURSE.Rem, db1.CATALOG_COURSE.Credits, 
                     db1.MEETINGS_COURSE.Day, db1.MEETINGS_COURSE.Start, db1.MEETINGS_COURSE.End
FROM db1.OFFERINGS_COURSE
        LEFT JOIN db1.CATALOG_COURSE ON (OFFERINGS_COURSE.CatalogID = CATALOG_COURSE.CatalogID)
        LEFT JOIN db1.PROGRAM ON (CATALOG_COURSE.ProgramName = PROGRAM.ProgramName)
        LEFT JOIN db1.INSTRUCTOR ON (OFFERINGS_COURSE.Name = INSTRUCTOR.Name)
        LEFT JOIN db1.MEETINGS_COURSE ON (OFFERINGS_COURSE.CRN = MEETINGS_COURSE.CRN)
        LEFT JOIN db1.LOCATION ON (MEETINGS_COURSE.Location = LOCATION.Location)
        LEFT JOIN TERM_WH ON (OFFERINGS_COURSE.Term = TERM_WH.Term)
        LEFT JOIN INSTRUCTOR_WH ON (INSTRUCTOR.Name = INSTRUCTOR_WH.Name);

 * sqlite:///CourseDataWarehouseDemo.db
0 rows affected.
381649 rows affected.

[]

<big><b>Step 5</b>: We perform a count to ensure that the total number of rows added to the fact table lines up with the count.</big>

In [22]:
%%sql

SELECT COUNT(*)
FROM REG_COURSE_WH;

 * sqlite:///CourseDataWarehouseDemo.db
Done.

[(381649,)]